MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK02FN64VLF10/mcu.h
#define EWM_CTRL                      (*((volatile uint32_t *)0x40061000))      // Control Register (EWM_CTRL)
#define EWM_SERV                      (*((volatile uint32_t *)0x40061001))      // Service Register (EWM_SERV)
#define EWM_CMPL                      (*((volatile uint32_t *)0x40061002))      // Compare Low Register (EWM_CMPL)
#define EWM_CMPH                      (*((volatile uint32_t *)0x40061003))      // Compare High Register (EWM_CMPH)
#define EWM_CLKPRESCALER              (*((volatile uint32_t *)0x40061005))      // Clock Prescaler Register (EWM_CLKPRESCALER)


//*****************************************************************************
//
// Watchdog Timer (WDOG) registers
//
//*****************************************************************************

#define WDOG_ST_CTRL_H                (*((volatile uint32_t *)0x40052000))      // Watchdog Status and Control Register High
#define WDOG_ST_CTRL_L                (*((volatile uint32_t *)0x40052002))      // Watchdog Status and Control Register Low
#define WDOG_TO_VAL_H                 (*((volatile uint32_t *)0x40052004))      // Watchdog Time-out Value Register High
#define WDOG_TO_VAL_L                 (*((volatile uint32_t *)0x40052006))      // Watchdog Time-out Value Register Low
#define WDOG_WIN_H                    (*((volatile uint32_t *)0x40052008))      // Watchdog Window Register High
#define WDOG_WIN_L                    (*((volatile uint32_t *)0x4005200A))      // Watchdog Window Register Low
#define WDOG_REFRESH                  (*((volatile uint32_t *)0x4005200C))      // Watchdog Refresh register
#define WDOG_UNLOCK                   (*((volatile uint32_t *)0x4005200E))      // Watchdog Unlock register
#define WDOG_TMROUTH                  (*((volatile uint32_t *)0x40052010))      // Watchdog Timer Output Register High
#define WDOG_TMROUTL                  (*((volatile uint32_t *)0x40052012))      // Watchdog Timer Output Register Low
#define WDOG_RSTCNT                   (*((volatile uint32_t *)0x40052014))      // Watchdog Reset Count register
#define WDOG_PRESC                    (*((volatile uint32_t *)0x40052016))      // Watchdog Prescaler register


//*****************************************************************************
//
// Multipurpose Clock Generator (MCG) registers
//
//*****************************************************************************

#define MCG_C1                        (*((volatile uint32_t *)0x40064000))      // MCG Control 1 Register
#define MCG_C2                        (*((volatile uint32_t *)0x40064001))      // MCG Control 2 Register
#define MCG_C3                        (*((volatile uint32_t *)0x40064002))      // MCG Control 3 Register
#define MCG_C4                        (*((volatile uint32_t *)0x40064003))      // MCG Control 4 Register
#define MCG_C5                        (*((volatile uint32_t *)0x40064004))      // MCG Control 5 Register
#define MCG_C6                        (*((volatile uint32_t *)0x40064005))      // MCG Control 6 Register
#define MCG_S                         (*((volatile uint32_t *)0x40064006))      // MCG Status Register
#define MCG_SC                        (*((volatile uint32_t *)0x40064008))      // MCG Status and Control Register
#define MCG_ATCVH                     (*((volatile uint32_t *)0x4006400A))      // MCG Auto Trim Compare Value High Register
#define MCG_ATCVL                     (*((volatile uint32_t *)0x4006400B))      // MCG Auto Trim Compare Value Low Register
#define MCG_C7                        (*((volatile uint32_t *)0x4006400C))      // MCG Control 7 Register
#define MCG_C8                        (*((volatile uint32_t *)0x4006400D))      // MCG Control 8 Register
#define MCG_C12                       (*((volatile uint32_t *)0x40064011))      // MCG Control 12 Register
#define MCG_S2                        (*((volatile uint32_t *)0x40064012))      // MCG Status 2 Register
#define MCG_T3                        (*((volatile uint32_t *)0x40064013))      // MCG Test 3 Register


//*****************************************************************************
//
// Oscillator (OSC) registers
//
//*****************************************************************************

#define OSC_CR                        (*((volatile uint32_t *)0x40065000))      // OSC Control Register
#define OSC_OSC_DIV                   (*((volatile uint32_t *)0x40065002))      // OSC Clock divider register


//*****************************************************************************
//
// Flash Memory Controller (FMC) registers
//
//*****************************************************************************

#define FMC_PFAPR                     (*((volatile uint32_t *)0x4001F000))      // Flash Access Protection Register (FMC_PFAPR)
#define FMC_PFB0CR                    (*((volatile uint32_t *)0x4001F004))      // Flash Bank 0 Control Register (FMC_PFB0CR)
#define FMC_TAGVDW0S0                 (*((volatile uint32_t *)0x4001F100))      // Cache Tag Storage (FMC_TAGVDW0S0)
#define FMC_TAGVDW0S1                 (*((volatile uint32_t *)0x4001F104))      // Cache Tag Storage (FMC_TAGVDW0S1)
#define FMC_TAGVDW0S2                 (*((volatile uint32_t *)0x4001F108))      // Cache Tag Storage (FMC_TAGVDW0S2)
#define FMC_TAGVDW0S3                 (*((volatile uint32_t *)0x4001F10C))      // Cache Tag Storage (FMC_TAGVDW0S3)
#define FMC_TAGVDW1S0                 (*((volatile uint32_t *)0x4001F110))      // Cache Tag Storage (FMC_TAGVDW1S0)
#define FMC_TAGVDW1S1                 (*((volatile uint32_t *)0x4001F114))      // Cache Tag Storage (FMC_TAGVDW1S1)
#define FMC_TAGVDW1S2                 (*((volatile uint32_t *)0x4001F118))      // Cache Tag Storage (FMC_TAGVDW1S2)
#define FMC_TAGVDW1S3                 (*((volatile uint32_t *)0x4001F11C))      // Cache Tag Storage (FMC_TAGVDW1S3)
#define FMC_TAGVDW2S0                 (*((volatile uint32_t *)0x4001F120))      // Cache Tag Storage (FMC_TAGVDW2S0)
#define FMC_TAGVDW2S1                 (*((volatile uint32_t *)0x4001F124))      // Cache Tag Storage (FMC_TAGVDW2S1)
#define FMC_TAGVDW2S2                 (*((volatile uint32_t *)0x4001F128))      // Cache Tag Storage (FMC_TAGVDW2S2)
#define FMC_TAGVDW2S3                 (*((volatile uint32_t *)0x4001F12C))      // Cache Tag Storage (FMC_TAGVDW2S3)
#define FMC_TAGVDW3S0                 (*((volatile uint32_t *)0x4001F130))      // Cache Tag Storage (FMC_TAGVDW3S0)
#define FMC_TAGVDW3S1                 (*((volatile uint32_t *)0x4001F134))      // Cache Tag Storage (FMC_TAGVDW3S1)
#define FMC_TAGVDW3S2                 (*((volatile uint32_t *)0x4001F138))      // Cache Tag Storage (FMC_TAGVDW3S2)
#define FMC_TAGVDW3S3                 (*((volatile uint32_t *)0x4001F13C))      // Cache Tag Storage (FMC_TAGVDW3S3)
#define FMC_DATAW0S0U                 (*((volatile uint32_t *)0x4001F200))      // Cache Data Storage (upper word) (FMC_DATAW0S0U)
#define FMC_DATAW0S0L                 (*((volatile uint32_t *)0x4001F204))      // Cache Data Storage (lower word) (FMC_DATAW0S0L)
#define FMC_DATAW0S1U                 (*((volatile uint32_t *)0x4001F208))      // Cache Data Storage (upper word) (FMC_DATAW0S1U)
#define FMC_DATAW0S1L                 (*((volatile uint32_t *)0x4001F20C))      // Cache Data Storage (lower word) (FMC_DATAW0S1L)
#define FMC_DATAW0S2U                 (*((volatile uint32_t *)0x4001F210))      // Cache Data Storage (upper word) (FMC_DATAW0S2U)
#define FMC_DATAW0S2L                 (*((volatile uint32_t *)0x4001F214))      // Cache Data Storage (lower word) (FMC_DATAW0S2L)
#define FMC_DATAW0S3U                 (*((volatile uint32_t *)0x4001F218))      // Cache Data Storage (upper word) (FMC_DATAW0S3U)
#define FMC_DATAW0S3L                 (*((volatile uint32_t *)0x4001F21C))      // Cache Data Storage (lower word) (FMC_DATAW0S3L)
#define FMC_DATAW1S0U                 (*((volatile uint32_t *)0x4001F220))      // Cache Data Storage (upper word) (FMC_DATAW1S0U)
#define FMC_DATAW1S0L                 (*((volatile uint32_t *)0x4001F224))      // Cache Data Storage (lower word) (FMC_DATAW1S0L)
#define FMC_DATAW1S1U                 (*((volatile uint32_t *)0x4001F228))      // Cache Data Storage (upper word) (FMC_DATAW1S1U)
#define FMC_DATAW1S1L                 (*((volatile uint32_t *)0x4001F22C))      // Cache Data Storage (lower word) (FMC_DATAW1S1L)
#define FMC_DATAW1S2U                 (*((volatile uint32_t *)0x4001F230))      // Cache Data Storage (upper word) (FMC_DATAW1S2U)
#define FMC_DATAW1S2L                 (*((volatile uint32_t *)0x4001F234))      // Cache Data Storage (lower word) (FMC_DATAW1S2L)


//*****************************************************************************
//
// Cyclic Redundancy Check (CRC) registers
//
//*****************************************************************************

#define CRC_DATA                      (*((volatile uint32_t *)0x40032000))      // CRC Data register
#define CRC_GPOLY                     (*((volatile uint32_t *)0x40032004))      // CRC Polynomial register
#define CRC_CTRL                      (*((volatile uint32_t *)0x40032008))      // CRC Control register


//*****************************************************************************
//
// Analog-to-Digital Converter (ADC) registers
//
//*****************************************************************************

